In [3]:
import os 
import pandas as pd

# DataFrame

In [7]:
df = pd.DataFrame([[1,2,3], [4,5,6]], columns=['a', 'b', 'c'])

In [15]:
# dir(df)

In [16]:
df.dtypes

a    int64
b    int64
c    int64
dtype: object

In [17]:
df.describe()

             a        b        c
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [12]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       2 non-null      int64
 1   b       2 non-null      int64
 2   c       2 non-null      int64
dtypes: int64(3)
memory usage: 176.0 bytes

In [19]:
# dir(df)

In [26]:
df.size

6

# Load Files into DataFrames

In [82]:
df = pd.read_csv("./data/coffee.csv")

In [83]:
#show the data: using df or display(dataframe)
display(df)

          Day Coffee Type  Units Sold
0      Monday    Espresso          25
1      Monday       Latte          15
2     Tuesday    Espresso          30
3     Tuesday       Latte          20
4   Wednesday    Espresso          35
5   Wednesday       Latte          25
6    Thursday    Espresso          40
7    Thursday       Latte          30
8      Friday    Espresso          45
9      Friday       Latte          35
10   Saturday    Espresso          45
11   Saturday       Latte          35
12     Sunday    Espresso          45
13     Sunday       Latte          35

In [32]:
df.info()
# df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 464.0+ bytes

In [ ]:
# df.loc[#ROW, #COLUMn]
#get row 1, 2,3
# df.loc[[1,2,3]]

# df.loc[1, 'Units Sold']

In [51]:
df.index=df.Day

In [55]:
# df.loc["Monday"]
df.loc["Monday":"Thursday"]

                 Day Coffee Type  Units Sold
Day
Monday        Monday    Espresso          25
Monday        Monday       Latte          15
Tuesday      Tuesday    Espresso          30
Tuesday      Tuesday       Latte          20
Wednesday  Wednesday    Espresso          35
Wednesday  Wednesday       Latte          25
Thursday    Thursday    Espresso          40
Thursday    Thursday       Latte          30

In [58]:
df.iloc[[1,2,3]]

        Coffee Type  Units Sold
Day
Monday        Latte          15
Tuesday    Espresso          30
Tuesday       Latte          20

In [61]:
# grab 1 value
df.iat[0,1]

'Espresso'

In [86]:
esp = df[df['Coffee Type'] == 'Espresso']

window size of 3, meaning for each new calculation, the function looks at the current value and the two preceding ones.

In [88]:
esp['Units Sold'].rolling(3).sum()

0       NaN
2       NaN
4      90.0
6     105.0
8     120.0
10    130.0
12    135.0
Name: Units Sold, dtype: float64

# Filter data

In [63]:
df = pd.read_csv("./data/bios.csv")

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [72]:
df.loc[df.height_cm > 215, 'name']
df.loc[(df.height_cm > 215) & (df.born_country=='USA'), 'name']

5781        Tommy Burleson
6722      Shaquille O'Neal
6937        David Robinson
123850      Tyson Chandler
Name: name, dtype: object

In [76]:
# df[df.name.str.contains('jen', case=False)]
df[df.name.str.contains(r'^[AEIOUaeiou]', na=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
15,16,Adrien Fauchier-Magnan,1873-11-19,Paris VIIIe,Paris,FRA,France,NaN,NaN,1965-08-06
19,20,André Gobert,1890-09-30,Paris XVIIe,Paris,FRA,France,NaN,NaN,1951-12-06
28,29,Albert Lippmann,NaN,NaN,NaN,NaN,France,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
145450,149174,Anna Shcherbakova,2004-03-28,Moskva (Moscow),Moskva,RUS,ROC,NaN,NaN,NaN
145454,149180,Anna Hoffmann,2000-03-28,Madison,Wisconsin,USA,United States,NaN,NaN,NaN
145457,149183,Alix Wilkinson,2000-08-02,Mammoth Lakes,California,USA,United States,NaN,NaN,NaN
145467,149194,Elisa Nakab,1998-05-08,Briançon,Hautes-Alpes,FRA,Italy,NaN,NaN,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18

In [80]:
df.query('born_country == "United States	" and born_city == "Wiscosin"')

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date]
Index: []

In [ ]:
df.index=df

In [34]:
df.index

RangeIndex(start=0, stop=14, step=1)

In [ ]:
# setting

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Day          14 non-null     object
 1   Coffee Type  14 non-null     object
 2   Units Sold   14 non-null     int64
dtypes: int64(1), object(2)
memory usage: 464.0+ bytes

df

In [5]:
df

   0
4  1
5  2
6  3